---
kind: property
id: P:Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUPatternMap
source: html/9d04830d-7cdc-44c5-dc55-8d73e2db993e.htm
---
# Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUPatternMap Property

The property labeled "Image" from the "MasonryCMU" schema.

## Syntax (C#)
```csharp
public static string MasonryCMUPatternMap { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.